changed to mermaid
